/* 2452640 汽车 罗啦 */
#include <iostream>
#include <iomanip>
using namespace std;

#define N_POW	112		//幂的次数
#define N_NUM	N_POW+1	//十进制形式的小数位数


void output_rod(const bool is_upper)
{
	if (is_upper) { //上标尺
		cout << "-----------------------------------------------------------------------------------------------------------------------------------" << endl;
		cout << "----------- 上标尺  1         2         3         4         5         6         7         8         9         A         B         C" << endl;
		cout << "-----------123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890" << endl;
		cout << "-----------------------------------------------------------------------------------------------------------------------------------" << endl;
	}
	else {//下标尺
		cout << "-----------------------------------------------------------------------------------------------------------------------------------" << endl;
		cout << "-----------123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890" << endl;
		cout << "----------- 下标尺  1         2         3         4         5         6         7         8         9         A         B         C" << endl;
		cout << "-----------------------------------------------------------------------------------------------------------------------------------" << endl;
	}
}

int main()
{
	/* 上标尺 */
	output_rod(1);

	int a[113][113] = { 0 };
	for (int i = 1; i <= 112; i++) {
		a[i][0] = -i;
	}
	a[1][1] = 5;
	for (int i = 2; i <= 112; i++) {
		for (int j = 1; j < i; j++) {
			int a1 = a[i - 1][j]*5 / 10;
			int a2 = a[i - 1][j]*5 % 10;
			a[i][j] += a1;
			a[i][j + 1] += a2;
		}
	}
	for (int i = 1; i <= 112; i++) {
		cout << "2^" << setw(4) << a[i][0] << " : 0.";
		for (int j = 1; j <= i; j++) {
			cout << a[i][j];
		}
		cout << endl;
	}
	/* 下标尺 */
	output_rod(0);
	cout << endl;

	cout << "请输入一个二进制纯小数，小数点开头，小数点后不超过112位(例：.101101)" << endl;
	cout << endl;
	char p[114];
	int i = 0;

	while (1) {
		i = 0;
		while (i < 113) {
			p[i] = getchar();
			if (p[i] == '\n') {
				p[i] = '\0';
				break;
			}
			i++;
		}
		if (i == 113) {
			int ch;
			while ((ch = getchar()) != '\n' && ch != EOF);
		}
		if (p[0] != '.') {
			cout << "不是以.开头，请重输" << endl;
			continue;
		}
		int v = 1;
		for (int j = 1; j < i; j++) {
			if (p[j] != '0' && p[j] != '1') {
				cout << "输入的不是0/1，请重输" << endl;
				v = 0;
				break;
			}
		}
		if (v) {
			break;
		}
	}
	/* 上标尺 */
	output_rod(1);
	int sum[114] = { 0 };
	int j;
	for (j = 1; p[j] != '\0'; j++) {
		if (p[j] == '1') {
			for (int k = 1; k <= j; k++) {
				sum[k] += a[j][k];
				
			}
		}
	}
	for ( ; p[j] != '1'; j--);
	p[j + 1] = '\0';
	for (; j > 0; j--) {
		if (sum[j] >= 10) {
			int t = sum[j] / 10;
			sum[j] %= 10;
			sum[j - 1] += t;
		}
	}
	cout << "输入数据 : ";
	for (int j = 1; p[j] != '\0'; j++)
		cout << p[j];
	cout << endl;
	cout << "计算值 : 0.";
	for (int j = 1; p[j] != '\0'; j++)
		cout << sum[j];
	cout << endl;
	/* 下标尺 */
	output_rod(0);
	cout << endl;
	return 0;
}

/*
PPT例题的测试数据
.00110011001100110011010
*/
